// miniprogram/pages/me/question/question.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    qa:[{
      q:"小程序的认证有什么作用？",
      a:"认证后的用户，平台将通过认证信息和跑步能力为用户评定跑步等级。平台将奖励用户一定数额积分，并为信息真实的用户提供马拉松赛事订阅服务、训练管理打卡通知服务等，用户可以享受智能化信息服务同时，有权在马拉松社区——不止步社区中发表帖子和跑步心得，与大众分享跑步经验等。平台也在每年的酷跑日准备精美礼品回馈忠实用户。"
    },
      {
        q: "用户如何加入跑团？",
        a: "登陆后的用户可以通过以下方式进行跑团绑定：*我的*->*我的跑团*->*填写信息*->*等待审核*"
      },
      {
        q: "我该如何在团体打卡？",
        a: "登陆后的用户可以通过以下方式进行团体打卡：*工具*->*训练打卡器*->*去打卡*->*填写信息*->*上传*->*切换当前视图为：团队*"
      },
      {
        q: "为什么团体打卡失败？",
        a: "请检查您是否绑定了跑团（若您未绑定可以参考第二个回答）？是否填写了团体ID（唯一识别码）？是否完善了打卡信息？是否当天已经参与团体打卡？"
      },
      {
        q: "更多问题请联系客服！",
        a: ""
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})